org/Economic_alternatives_for_the_future_by_Roberto_Mangabeira_Unger_in_2020.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Economic_alternatives_for_the_future_by_Roberto_Mangabeira_Unger_in_2020
#+TITLE: Economic alternatives for the future by Roberto Mangabeira Unger in 2020
* [[file:economics.org][economics]], [[file:lectures.org][lectures]], [[file:Roberto_Mangabeira_Unger.org][Roberto Mangabeira Unger]]
* 7:36 Introduction to the series "Economic alternatives for the future"  
* 5:51 The New Dilemma of Development  
* 10:25 The Knowledge Economy and Its Future  
* 10:29 Labor and Capital  [[file:progress_indicators.org][progress indicators]]
* 8:30 Finance and the Real Economy  
* 9:42 Taxation and Inequality  
* 3:24 The Capable Agent: Security and Plasticity  
* 8:42 The Capable Agent: Education 
* 7:10 High-Energy Democracy 
* 5:26 The Progressive Alternatives: Anxiety and Depression 
