content/posts/Economic_alternatives_for_the_future_by_Roberto_Mangabeira_Unger_in_2020.md
+++
title = "Economic alternatives for the future by Roberto Mangabeira Unger in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:18-04:00
slug = "Economic_alternatives_for_the_future_by_Roberto_Mangabeira_Unger_in_2020"
draft = false
+++

## [economics]({{< relref "economics" >}}), [lectures]({{< relref "lectures" >}}), [Roberto Mangabeira Unger]({{< relref "Roberto_Mangabeira_Unger" >}}) {#economics--economics-dot-md--lectures--lectures-dot-md--roberto-mangabeira-unger--roberto-mangabeira-unger-dot-md}


## 7:36 Introduction to the series "Economic alternatives for the future" {#7-36-introduction-to-the-series-economic-alternatives-for-the-future}


## 5:51 The New Dilemma of Development {#5-51-the-new-dilemma-of-development}


## 10:25 The Knowledge Economy and Its Future {#10-25-the-knowledge-economy-and-its-future}


## 10:29 Labor and Capital  [progress indicators]({{< relref "progress_indicators" >}}) {#10-29-labor-and-capital-progress-indicators--progress-indicators-dot-md}


## 8:30 Finance and the Real Economy {#8-30-finance-and-the-real-economy}


## 9:42 Taxation and Inequality {#9-42-taxation-and-inequality}


## 3:24 The Capable Agent: Security and Plasticity {#3-24-the-capable-agent-security-and-plasticity}


## 8:42 The Capable Agent: Education {#8-42-the-capable-agent-education}


## 7:10 High-Energy Democracy {#7-10-high-energy-democracy}


## 5:26 The Progressive Alternatives: Anxiety and Depression {#5-26-the-progressive-alternatives-anxiety-and-depression}
